

# print(range(8))
#
# for i in range(1,5):
#
#     print('我在吃第{}个馒头'.format(i))
# print('终于吃饱了')



###################################################################################################################


# print(range(8))
#
# for i in range(1,27):
#     if i % 3==0:
#         print('不爱吃')
#     else:
#         print('我在吃第{}个馒头'.format(i))
# print('终于吃饱了')


###################################################################################################################

"""pass"""
# if 10>7:
#     print('大')
# else:
#     pass
#
# print('判断结束')
#
# for i in range(5):
#     pass


###################################################################################################################

'''break'''
# for i in range(3):
#     name = input('请输入名字：')
#     password = input('请输入密码：')
#     if name == 'hzh' and password == '123':
#         print('欢迎进入!')
#         break#跳出for
#     else:
#         print('用户名或密码错误第{}次'.format(i+1))
# else:
#     print('账户锁定！') #break出来后不会进入这个else,这个else属于for循环主体,for全部循环玩才会使用这个else

###################################################################################################################


'''range(x,y,z) z=step'''

# for i in range(1,10,6):
#         print(i)


###################################################################################################################


'''while'''
'''打印0~30`间3的倍数'''
# i = 0
# while i <=30:
#     if i %3 ==0:
#        print(i)
#     i+=1



'''错误的方法'''
# i = 0
# while i <=30 and i %3 ==0:
#        print(i)
#        i+=1

#该方法不行，因为0开始判断时就不符合于是直接跳出while



'''3和5的倍数'''
# i = 0
# while i <=30:
#     if i %3 ==0 and i % 5 == 0:
#        print(i)
#     i+=1
#
# for i in range(31):
#     if i %3 ==0 and i % 5 == 0:
#         print(i)





###################################################################################################################


'''1+2+3+4....='''
# num = 1
# sum = 0
# while num <= 20:
#     sum += num
#     print(sum, '第{}位'.format(num))
#     num +=1



###################################################################################################################
'''
*
**
***
****
*****
'''
# i=6
# while i>0:
#         print('*'*i)
#         i-=1



# for i in range(1,6):
#     print('*'*i)


'''嵌套'''
# level = 1
# while level<=5:
#     count =1
#     while count <=level:
#         print('*',end='')
#         count +=1
#     level +=1
#     print()

'''99乘法表'''
# x=1
# while x<=9:
#     y = 1
#     while y <= x:
#         z = x*y
#         print('{}乘{}得{}'.format(y,x,z),end=' | ')
#         y+=1
#     x+=1
#     print('')


###################################################################################################################


'''break continue'''


sum =0
for i in range(10):
    if i% 3 ==0:
        continue
    sum+=i

print(sum)
'''continue跳过下方语句不执行，继续执行下一次的循环'''


sum =0
for i in range(10):
    if i% 3 ==0:
        pass
    sum+=i

print(sum)
'''pass可有可恶，结果等于1～9的和'''



sum =0
for i in range(10):
    if i% 3 ==0:
        break
    sum+=i

print(sum)
'''i=0的时候符合条件直接break出去，跳出整个for循环'''

###################################################################################################################

























